DESIGNER/Catalogs/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Задачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУсловияПоиска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУсловийПоиска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КачествоРешения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КачествоРешенияЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПострочногоПоиска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПострочногоПоиска</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантПоиска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыПоиска</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МеткаВКоде</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DESIGNER/InformationRegisters/СведенияОПоискеЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПоискеЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УсловиеПоискаНайдено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерНачальнойСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСимволаНачальнойСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКонечнойСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСимволаКонечнойСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БлокПрограммногоКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DESIGNER/Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DESIGNER/Enums/ВариантыУсловийПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыУсловийПоиска</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоследовательныйПоискПоСтрокам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерваяСтрокаФайла</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DESIGNER/Catalogs/Задачи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьИнформациюПоАктуальностиЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементовФормы();
	ТекущийЭлемент = Элементы.Файл;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьИнформациюПоАктуальностиЗадачи();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Запись_Задача");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.Выполнено") 
		И Объект.ДатаЗавершения = Дата(1, 1, 1) Тогда

		Объект.ДатаЗавершения = ТекущаяДата();
		
	КонецЕсли;
	
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.КВыполнению")  Тогда
		Объект.ДатаЗавершения = Дата(1, 1, 1);
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ВариантУсловияПоискаПриИзменении(Элемент)
	
	ПоискПоСтрокам = ПредопределенноеЗначение("Перечисление.ВариантыУсловийПоиска.ПоследовательныйПоискПоСтрокам");
	
	Элементы.Условия.Доступность = Объект.ВариантУсловияПоиска = ПоискПоСтрокам;

КонецПроцедуры

&НаКлиенте
Процедура ТипЗадачиПриИзменении(Элемент)
	
	Если Объект.ТипЗадачи.Пустая() Тогда
		Возврат;
	КонецЕсли;

	РеквизитыТипаЗадачи = РеквизитыТипаЗадачи(Объект.ТипЗадачи);
	
	Если ПустаяСтрока(Объект.Описание) Тогда
		Объект.Описание = РеквизитыТипаЗадачи.Описание;	
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = РеквизитыТипаЗадачи.Наименование;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУсловия

&НаКлиенте
Процедура УсловияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "УсловияУсловие" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеРедактированияУсловияПоиска", ЭтотОбъект);
		
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
			ОписаниеОповещения, Элемент.ТекущиеДанные.Условие, НСтр("ru='Условие поиска'"));
		
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОпределитьПараметрыВИсходномКоде(Команда)
	
	РаботаСЗадачамиКлиент.ОбновитьСведенияПоЗадачам(Объект.Конфигурация, Объект.Ссылка);
	ОбновитьИнформациюПоАктуальностиЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	РаботаСЗадачамиКлиент.ОткрытьФайл(Объект.Файл);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.КачествоРешения.Доступность = Объект.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.Выполнено");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРедактированияУсловияПоиска(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Элементы.Условия.ТекущиеДанные.Условие = ВведенныйТекст;
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюПоАктуальностиЗадачи()
	
	УсловиеНайдено = УсловиеПоискаПоЗадачеНайдено();
	
	Если УсловиеНайдено Тогда
		Элементы.КартинкаАктуальностьЗадачи.Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
	Иначе
		Элементы.КартинкаАктуальностьЗадачи.Картинка = БиблиотекаКартинок.ОформлениеКрест;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция УсловиеПоискаПоЗадачеНайдено()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОПоискеЗадачСрезПоследних.УсловиеПоискаНайдено КАК УсловиеПоискаНайдено
		|ИЗ
		|	РегистрСведений.СведенияОПоискеЗадач.СрезПоследних(, Задача = &Задача) КАК СведенияОПоискеЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		 УсловиеНайдено = Ложь;
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
		УсловиеНайдено = Выборка.УсловиеПоискаНайдено;
		
	КонецЕсли;
	
	Возврат УсловиеНайдено;
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыТипаЗадачи(ТипЗадачи)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТипыЗадач.Наименование КАК Наименование,
		|	ТипыЗадач.Описание КАК Описание
		|ИЗ
		|	Справочник.ТипыЗадач КАК ТипыЗадач
		|ГДЕ
		|	ТипыЗадач.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТипЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();
	
	РеквизитыТипаЗадачи = Новый Структура("Наименование, Описание");
	ЗаполнитьЗначенияСвойств(РеквизитыТипаЗадачи, Выборка);
	
	Возврат  РеквизитыТипаЗадачи;
	
КонецФункции

#КонецОбласти
